---
kind: enumMember
id: F:Autodesk.Revit.DB.NumberSystemJustifyOption.Center
enum: Autodesk.Revit.DB.NumberSystemJustifyOption
source: html/79101502-12b0-a9e3-06d1-5e5124e41261.htm
---
# Autodesk.Revit.DB.NumberSystemJustifyOption.Center

The number will locate in the center of the annotated object along the annotating direction.